In [1]:
# Dependencies
import pandas as pd
import numpy as np
from pandas import *

In [2]:
# Store filepath in a variable
file = "cities.csv"

In [3]:
# Read our Data file with the pandas library
# Not every CSV requires an encoding, but be aware this can come up
file_df = pd.read_csv(file, encoding="ISO-8859-1")

In [4]:
# Show just the header
file_df.head()

,City_ID,City,Cloudiness,Country,Date,Humidity,Lat,Lng,Max Temp,Wind Speed
0,0,jacareacanga,0,BR,1528902000,62,-6.22,-57.76,89.60,6.93
1,1,kaitangata,100,NZ,1528905304,94,-46.28,169.85,42.61,5.64
2,2,goulburn,20,AU,1528905078,91,-34.75,149.72,44.32,10.11
3,3,lata,76,IN,1528905305,89,30.78,78.62,59.89,0.94
4,4,chokurdakh,0,RU,1528905306,88,70.62,147.90,32.17,2.95

In [5]:
# Show a single column
file_one_df["first_name"].head()

0       David
1     Stephen
2      Evelyn
3         Joe
4    Benjamin
Name: first_name, dtype: object

In [6]:

columns = ["first_name", "email"]
file_one_df[columns].head()

  first_name                    email
0      David         djordan0@home.pl
1    Stephen  sriley1@hugedomains.com
2     Evelyn  egrant2@livejournal.com
3        Joe         jmendoza3@un.org
4   Benjamin   brodriguez4@elpais.com

In [7]:
# Head does not change the DataFrame--it only displays it
file_one_df.head()

   id first_name  last_name                    email  gender
0   1      David     Jordan         djordan0@home.pl    Male
1   2    Stephen      Riley  sriley1@hugedomains.com    Male
2   3     Evelyn      Grant  egrant2@livejournal.com  Female
3   4        Joe    Mendoza         jmendoza3@un.org    Male
4   5   Benjamin  Rodriguez   brodriguez4@elpais.com    Male

In [8]:
# Export file as a CSV
file_one_df.to_csv("Output/fileOne.csv", index=False, header=True)
file_one_df.to_csv("Output/fileOneWithIndex.csv", index=True, header=False,)

In [10]:
!head Output/fileOneWithIndex.csv

0,1,David,Jordan,djordan0@home.pl,Male
1,2,Stephen,Riley,sriley1@hugedomains.com,Male
2,3,Evelyn,Grant,egrant2@livejournal.com,Female
3,4,Joe,Mendoza,jmendoza3@un.org,Male
4,5,Benjamin,Rodriguez,brodriguez4@elpais.com,Male
5,6,Kathleen,Crawford,kcrawford5@cbsnews.com,Female
6,7,Daniel,Marshall,dmarshall6@salon.com,Male
7,8,Diana,Coleman,dcoleman7@amazonaws.com,Female
8,9,Frances,Black,fblack8@webnode.com,Female
9,10,Tammy,Arnold,tarnold9@ebay.co.uk,Female